{
  "guns": [
    {
      "id": 1,
      "name": "Pump",
      "image": "/images/Pump.jpeg",
      "description": "Inspired by the equipment used in Fortnite, the Nerf Mega Pump SG blaster captures the look of the one in the popular video game. Fire a big Nerf Mega dart into the battle and dominate the map! It's easy to get ready for action: Open the door on the side of this breech-load blaster, load 1 dart inside, pump the slide backward and forward to prime the blaster, and press the trigger to send the dart flying through the air. "
    },
    {
      "id": 2,
      "name": "Pharaoh",
      "image": "/images/Pharaoh.jpeg",
      "description": "Experience Nerf Ultra blasters -- the ultimate in Nerf dart blasting! Nerf Ultra blasters have advanced design and performance to deliver extreme distance, accuracy, and speed. They include ground-breaking Nerf Ultra darts -- the farthest flying Nerf darts EVER, featuring an innovative flight tip, Aerofin technology, and Nerf Ultra foam. Take your game to the next level with Nerf Ultra blasters and darts! Nerf Ultra blasters work only with Nerf Ultra darts."
    },
    {
      "id": 3,
      "name": "Stegosmash",
      "image": "/images/Stegosmash.jpeg",
      "description": "Stand your ground as dart-blasting defender with the Nerf DinoSquad Stego-Smash blaster! It features an awesome dinosaur design, capturing the look of a Stegosaurus dinosaur. Fire into dino-tastic fun with this single-fire blaster -- load 1 dart into the front of the barrel, pull back the handle to prime, and press the trigger to send the dart charging toward your target. There's onboard 4-dart storage on the front of the blaster so you can have backup firepower within reach for reloads. Includes 5 Official Nerf Elite foam darts that are tested and approved for performance and quality. Eyewear recommended (not included). No batteries required."
    },
    {
      "id": 4,
      "name": "Roblox",
      "image": "/images/Roblox.jpeg",
      "description": "This Nerf Roblox Adopt Me!: BEES! dart-firing blaster takes its inspiration the Roblox Adopt Me! game! It includes a special code that allows you to redeem an exclusive virtual item on Roblox! The blaster features lever-action blasting and a rotating 8-dart drum, and includes 8 Nerf darts so you can fire 8 darts in a row. Load the drum, move the lever to prime the blaster, and press the trigger to unleash a dart. Official Nerf Elite foam darts are tested and approved for performance and quality and are great for indoor and outdoor play. Eyewear recommended (not included). No batteries required."
    },
    {
      "id": 5,
      "name": "Warden",
      "image": "/images/Warden.jpeg",
      "description": "Gear up for battle with Nerf Elite 2.0 blasters that feature built-in customizing capabilities so you can upgrade them and seize the advantage in Nerf competitions. Build your stockpile of Nerf Elite 2.0 blasters to optimize your game strategy and bring tactical performance and flexibility to every mission and battle! "
    },
    {
      "id": 6,
      "name": "Fortnite",
      "image": "/images/Fortnite.jpeg",
      "description": "The Nerf Fortnite GL blaster is inspired by the one used in Fortnite, replicating the look of the one from the popular video game. The GL blaster fires big foam Nerf rockets for big battling action! It has a rotating drum that holds up to 6 rockets and fires 1 rocket at a time as you manually move the handle. Push the handle all the way forward -- the drum rotates to place a rocket in firing position. "
    },
    {
      "id": 7,
      "name": "Elite",
      "image": "/images/Elite.jpeg",
      "description": "Nerf N-strike Elite Infinus with Speed-Load Technology offers continuous fun. It features a special motorized design that automatically loads darts from the drum. This saves time and eliminates the need to load them by hand. The drum stays attached to the Infinus Blaster and is detachable but does not need to be removed to be reloaded. "
    },
    {
      "id": 8,
      "name": "Scorpion",
      "image": "/images/Scorpion.jpeg",
      "description": "Give your adventurous child a toy they're sure to love with this Scorpion Gatling Blaster from Adventure Force! Designed with a fully automatic motorized rotating barrel with rapid-fire action, this unique foam dart blaster holds 1 round of ammo of 20 darts. With an impressive 80-foot launch distance, the Powerbolt Belt Blaster combines speed, distance and the strength of motorization to keep your game sharp and you playing for longer. Ideal for a dart blaster game amongst friends, or to practice your shot on your own, this versatile foam dart blaster includes an impressive 20 foam darts that are compatible with all Adventure Force Blasters and most standard NERF blasters. "
    },
    {
      "id": 9,
      "name": "V-Twin",
      "image": "/images/V-Twin.jpeg",
      "description": "The V-Twin is battery-powered and delivers full-auto blasting. Hold down the Rev-Trigger to power-up the flywheels and then pull back the primary trigger to blast darts flying up to 80 feet. The darts fly out of the rotating gatling style barrel. V-Twin measures 11\" H x 12\" W x 21\" L. V-Twin comes with a 30-Round ammo belt that fires over 3 darts per second. The blaster holds up to 60 darts at one time with the (2) 15-round cylinders that provide built-in storage for quick reloading. V-Twin includes 30 Waffle-Tip Darts and the Darts are compatible with all Adventure Force Blasters and most standard NERF blasters. "
    },
    {
      "id": 10,
      "name": "Flipshots",
      "image": "/images/Flipshots.jpeg",
      "description": "Flip into battle with the Nerf Elite 2.0 Flipshots Flip-8 blaster! The blaster features 8 barrels -- 4 face forward and 4 face backward. Fire darts from the 4 front-facing barrels, then flip the 4 rear barrels forward to keep on blasting darts. Just when your opponents think you’re out, you can take them by surprise with 4 more fully-loaded barrels! The back-to-back barrels are connected, making it quick and easy to rotate them by pulling back the sight. "
    },
    {
      "id": 11,
      "name": "Adventure",
      "image": "/images/Adventure.jpeg",
      "description": "Adventure Force Double Fire by Buzz Bee Toys is a twin barrel dart blaster that features hinge action loading. Open up you blaster and insert you darts; you are loaded and ready to launch yous darts at you target. This blaster has a dual stage trigger: pull trigger to launch one dart and pull the trigger all the way to launch the second dart. The stock has an attachment so that you can add a side saddle dart holder to either side for extra ammo. "
    },
    {
      "id": 12,
      "name": "Electric",
      "image": "/images/Electric.jpeg",
      "description": "Get your friends together and battle off in an action-packed, long-range game! Enjoy a safe playing experience with low impact foam balls, perfect for using both indoors and outside. 8-round drum, an anti-jam hatch, and an extending barrel make this the perfect blaster, while a moveable and foldable bipod is included for when you want to test your accuracy. With this big blaster on your side, it's game over for your opponents! "
    },
    {
      "id": 13,
      "name": "Springfire",
      "image": "/images/Springfire.jpeg",
      "description": "Adventure Force Springfire is the on the go dart blaster with spring power. With its easy pull back handles and automatic advancing barrels, this dart blaster will provide hours of fast dart blasting action up to 80 feet away. The see-through body shows off the cool spring power. Item comes with dart blaster and 10 long distance darts. Recommended for children 8 years of age and older. "
    },
    {
      "id": 14,
      "name": "Alien",
      "image": "/images/Alien.jpeg",
      "description": "Go big or go home - with this extra-large dart launcher with 32-inch barrel, the only place your headed to is victory! This 32-inch alien rifle blaster shoots glow-in-the-dark darts up to 45 feet! Foam darts load easily so you can quickly get back to the fun while suction-tipped darts stick to walls and other surfaces, great for target practice. This set includes 40 darts, LED lights, and a collapsible scope to help you accurately hit any target. Compatible with major brands of dart refills. "
    },
    {
      "id": 15,
      "name": "Destroyer",
      "image": "/images/Destroyer.jpeg",
      "description": "Treat your kid to an Adventure Force Destroyer foam dart blaster and watch them wage a dart war with friends. Designed for use by ages 8 and up, the Destroyer dart blaster is a super-fun addition to any toy collection, and is sure to provide countless hours of battle. This 25-piece set has everything you need to practice your aim and perfect your battle skills. With a 6-dart capacity, 90-ft range, and a vibrant, eye-catching design, the Destroyer is sure to be a hit with kids of all ages. The set includes 24 reusable foam darts that are compatible with all Adventure Force dart blasters and most standard NERF blasters. For some active and dynamic fun, pick up the Adventure Force Destroyer blaster today and see how much fun shooting darts can be! "
    },
    {
      "id": 16,
      "name": "Flipshots",
      "image": "/images/Flipshots.jpeg",
      "description": "Treat your kid to an Adventure Force Destroyer foam dart blaster and watch them wage a dart war with friends. Designed for use by ages 8 and up, the Destroyer dart blaster is a super-fun addition to any toy collection, and is sure to provide countless hours of battle. This 25-piece set has everything you need to practice your aim and perfect your battle skills. With a 6-dart capacity, 90-ft range, and a vibrant, eye-catching design, the Destroyer is sure to be a hit with kids of all ages. "
    },
    {
      "id": 17,
      "name": "Rapid",
      "image": "/images/Rapid.jpeg",
      "description": "Sharpen your aim and blast off to victory! Enjoy rapid fire shooting with an electric motor that blasts 25 low-impact foam balls at any opponent that stands in your way. This battery powered blaster is designed with a magazine on the top and a side door to clear up any jams in just seconds. An anti-jamming hatch prevents firing when open so you can reload and get back to action-packed fun! "
    },
    {
      "id": 18,
      "name": "Blazer",
      "image": "/images/Blazer.jpeg",
      "description": "Adventure Force Battle Blazer allows for continuous dart blasting action. Fill the 12 round dart belt with darts and load it into the blaster; pull back the top handle and squeeze the trigger to launch your dart up to 80 feet. Includes one 12 round dart belt that will keep you in the action longer. The dart belt is adjustable for various lengths so you can customize your round size. Item comes with dart blaster, 12 long distance darts and dart belt. "
    },
    {
      "id": 19,
      "name": "Mech",
      "image": "/images/Mech.jpeg",
      "description": "Adventure Force Rebel Mech with its rapid fire 30 count dart drum clip allows for continuous fast paced dart blasting action. This easy loading, motorized dart blaster will hit your target up to 100 feet away. Its detachable, dart drum clip, holds 30 long distance darts for no stop action. The dart drum clip is interchangeable with other dart clip blasters that are sold separately. Comes with dart blaster, dart drum clip and 30 long distance darts. Requires batteries that are not included.  "
    },
    {
      "id": 20,
      "name": "Takedown",
      "image": "/images/Takedown.jpeg",
      "description": "Take on and take down all challengers in Nerf Rival games with the pump-action Nerf Rival Takedown XX-800 blaster. Load this spring-action blaster, pump the priming handle, and press the trigger to fire 1 round. The Takedown XX-800 blaster has an 8-round capacity, so choose your targets and fire 8 rounds in a row. Go the distance with this Team Red blaster that launches rounds at 90 feet per second. "
    },
    {
      "id": 21,
      "name": "Motostryke",
      "image": "/images/Motostryke.jpeg",
      "description": "Intimidating. Definitely. Impressive. Absolutely! Huge, powerful, and fast, the Nerf Mega Motostryke blaster blisters the battlefield with motorized, 10-dart blasting. This is a blaster that demands attention and gets it. Power up the motor and pull the trigger to send a big Nerf Mega dart whistling through the air. Start blasting! Load darts into the clip, and insert the full clip into the blaster. Hold down the acceleration button to rev the motor, and pull the trigger to fire 1 dart. Pull the trigger again to fire another dart. Strike big and strike fast with the Nerf Mega Motostryke blaster!"
    }
  ]
}